EDT/УТ/src/InformationRegisters/зпМинимальныеСтавки/зпМинимальныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпМинимальныеСтавки</name>
  <resources>
    <name>МинимальнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМинимальнойСтавки</name>
    <type>
      <types>EnumRef.зпВидыМинимальныхСтавок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкОтработанныхДней</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкМинимальногоПроцентаВыполнения</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкМинимальногоПробегаПоРейсу</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/зпИсходныеДанныеРасчетаМинимальнойЗП/зпИсходныеДанныеРасчетаМинимальнойЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпИсходныеДанныеРасчетаМинимальнойЗП</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуммаЗаказы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПодъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПримерка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентВыполненияЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БрейкМинимальногоПроцентаВыполнения</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </resources>
  <resources>
    <name>БрейкМинимальногоПробегаПоРейсу</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяМинимальнаяСтавка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаМинимальнойСтавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПерерасчетПоИтогуМесяца</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаНачисленияМинимальнойСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.зпВидыЗанятости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/зпМинимальныеСтавки/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекОтбор = ЭтотОбъект.Отбор;
	Если ТекОтбор.СхемаРасчетаЗП.Использование Тогда
		СхемаРасчетаЗП = ТекОтбор.СхемаРасчетаЗП.Значение;
		СхемаРазрешена = СхемаРасчетаЗП.РазрешитьРедактирование Или зпРаботаСРасчетомЗарплатыСервер.НетЗаписиВРегистре("РегистрСведений.зпИсходныеДанныеРасчетаМинимальнойЗП", "СхемаРасчетаЗП", СхемаРасчетаЗП);
	Иначе
		СхемаРазрешена = Истина;
	КонецЕсли;
	Если ТекОтбор.ТарифРасчетаЗП.Использование Тогда
		ТарифРасчетаЗП = ТекОтбор.ТарифРасчетаЗП.Значение;
		ТарифРазрешен = ТарифРасчетаЗП.РазрешитьРедактирование Или зпРаботаСРасчетомЗарплатыСервер.НетЗаписиВРегистре("РегистрСведений.зпИсходныеДанныеРасчетаМинимальнойЗП", "ТарифРасчетаЗП", ТарифРасчетаЗП);
	Иначе
		ТарифРазрешен = Истина;
	КонецЕсли;
	
	Если Не (СхемаРазрешена И ТарифРазрешен) Тогда
		Отказ = Истина;
		Сообщить("Редактирование запрещено");
		Если Не СхемаРазрешена Тогда
			Сообщить("Обнаружены данные по Схеме расчета!");
		КонецЕсли;
		Если Не ТарифРазрешен Тогда
			Сообщить("Обнаружены данные по Тарифу расчета!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
